7767517
561 665
Input                    in0                      0 1 in0
Convolution              conv_22                  1 1 in0 1 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432
Swish                    silu_148                 1 1 1 2
Convolution              conv_23                  1 1 2 3 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=4608
Swish                    silu_149                 1 1 3 4
Convolution              conv_24                  1 1 4 5 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_150                 1 1 5 6
Slice                    split_0                  1 2 6 7 8 -23300=2,16,16 1=0
Split                    splitncnn_0              1 3 8 9 10 11
Convolution              conv_25                  1 1 11 12 0=8 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152
Swish                    silu_151                 1 1 12 13
Convolution              conv_26                  1 1 13 14 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152
Swish                    silu_152                 1 1 14 15
BinaryOp                 add_0                    2 1 10 15 16 0=0
Concat                   cat_0                    3 1 7 9 16 17 0=0
Convolution              conv_27                  1 1 17 18 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3072
Swish                    silu_153                 1 1 18 19
Split                    splitncnn_1              1 4 19 20 21 22 23
Pooling                  gap_14                   1 1 20 24 0=1 4=1
Convolution              conv_28                  1 1 24 25 0=8 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
Swish                    silu_154                 1 1 25 26
Convolution              conv_29                  1 1 26 27 0=3 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24
Softmax                  softmax_1                1 1 27 28 0=0 1=1
Reshape                  reshape_291              1 1 28 29 0=1 1=1 2=-1
Tile                     repeat_325               1 1 29 30 -23302=3,1,160,160
ConvolutionDepthWise     convdw_370               1 1 23 31 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=576 7=64
Convolution              conv_30                  1 1 31 32 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_155                 1 1 32 33
Slice                    tensor_split_0           1 3 30 34 35 36 -23300=3,1,1,-233 1=0
ConvolutionDepthWise     convdw_371               1 1 22 37 0=64 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=0 6=1600 7=64
Convolution              conv_31                  1 1 37 38 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_156                 1 1 38 39
ConvolutionDepthWise     convdw_372               1 1 21 40 0=64 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=0 6=3136 7=64
Convolution              conv_32                  1 1 40 41 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_157                 1 1 41 42
BinaryOp                 mul_1                    2 1 42 36 43 0=2
BinaryOp                 mul_2                    2 1 39 35 44 0=2
BinaryOp                 mul_3                    2 1 33 34 45 0=2
BinaryOp                 add_4                    2 1 45 44 46 0=0
BinaryOp                 add_5                    2 1 46 43 47 0=0
BatchNorm                bn_18                    1 1 47 48 0=64 1=0.001
Swish                    silu_158                 1 1 48 49
Convolution              conv_33                  1 1 49 50 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=36864
Swish                    silu_159                 1 1 50 51
Convolution              conv_34                  1 1 51 52 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_160                 1 1 52 53
Slice                    split_1                  1 2 53 54 55 -23300=2,32,32 1=0
Split                    splitncnn_2              1 3 55 56 57 58
Convolution              conv_35                  1 1 58 59 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Swish                    silu_161                 1 1 59 60
Convolution              conv_36                  1 1 60 61 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Swish                    silu_162                 1 1 61 62
BinaryOp                 add_6                    2 1 57 62 63 0=0
Concat                   cat_1                    3 1 54 56 63 64 0=0
Convolution              conv_37                  1 1 64 65 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288
Swish                    silu_163                 1 1 65 66
Split                    splitncnn_3              1 4 66 67 68 69 70
Pooling                  gap_15                   1 1 67 71 0=1 4=1
Convolution              conv_38                  1 1 71 72 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_164                 1 1 72 73
Convolution              conv_39                  1 1 73 74 0=3 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=48
Softmax                  softmax_2                1 1 74 75 0=0 1=1
Reshape                  reshape_292              1 1 75 76 0=1 1=1 2=-1
Tile                     repeat_326               1 1 76 77 -23302=3,1,80,80
ConvolutionDepthWise     convdw_373               1 1 70 78 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=1152 7=128
Convolution              conv_40                  1 1 78 79 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_165                 1 1 79 80
Slice                    tensor_split_1           1 3 77 81 82 83 -23300=3,1,1,-233 1=0
ConvolutionDepthWise     convdw_374               1 1 69 84 0=128 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=0 6=3200 7=128
Convolution              conv_41                  1 1 84 85 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_166                 1 1 85 86
ConvolutionDepthWise     convdw_375               1 1 68 87 0=128 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=0 6=6272 7=128
Convolution              conv_42                  1 1 87 88 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_167                 1 1 88 89
BinaryOp                 mul_7                    2 1 89 83 90 0=2
BinaryOp                 mul_8                    2 1 86 82 91 0=2
BinaryOp                 mul_9                    2 1 80 81 92 0=2
BinaryOp                 add_10                   2 1 92 91 93 0=0
BinaryOp                 add_11                   2 1 93 90 94 0=0
BatchNorm                bn_19                    1 1 94 95 0=128 1=0.001
Swish                    silu_168                 1 1 95 96
Split                    splitncnn_4              1 2 96 97 98
Convolution              conv_43                  1 1 98 99 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456
Swish                    silu_169                 1 1 99 100
Convolution              conv_44                  1 1 100 101 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_170                 1 1 101 102
Split                    splitncnn_5              1 3 102 103 104 105
Convolution              conv_45                  1 1 105 106 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288
Reshape                  flatten_396              1 1 106 107 0=1600 1=192
Permute                  transpose_345            1 1 107 108 0=1
Reshape                  reshape_293              1 1 108 109 0=96 1=2 11=400 2=4
Permute                  permute_251              1 1 109 110 0=3
Slice                    split_2                  1 3 110 111 112 113 -23300=3,32,32,32 1=2
Split                    splitncnn_6              1 2 113 114 115
Permute                  transpose_346            1 1 111 116 0=1
MatMul                   matmul_329               2 1 116 112 117
BinaryOp                 mul_12                   1 1 117 118 0=2 1=1 2=0.176776692
Softmax                  softmax_3                1 1 118 119 0=3 1=1
MatMul                   matmultransb_0           2 1 115 119 120 0=1
Permute                  permute_252              1 1 120 121 0=4
Permute                  permute_253              1 1 114 122 0=4
Reshape                  reshape_294              1 1 121 123 0=64 1=40 2=40
Permute                  permute_254              1 1 123 124 0=4
Reshape                  reshape_295              1 1 122 125 0=64 1=40 2=40
Permute                  permute_255              1 1 125 126 0=4
ConvolutionDepthWise     convdw_376               1 1 126 127 0=64 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=1 6=3136 7=64
BinaryOp                 add_13                   2 1 124 127 128 0=0
Convolution              conv_46                  1 1 128 129 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
BinaryOp                 add_14                   2 1 104 129 130 0=0
Split                    splitncnn_7              1 2 130 131 132
Convolution              conv_47                  1 1 132 133 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_171                 1 1 133 134
Convolution              conv_48                  1 1 134 135 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
BinaryOp                 add_15                   2 1 131 135 136 0=0
Split                    splitncnn_8              1 2 136 137 138
Convolution              conv_49                  1 1 138 139 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288
Reshape                  flatten_397              1 1 139 140 0=1600 1=192
Permute                  transpose_348            1 1 140 141 0=1
Reshape                  reshape_296              1 1 141 142 0=96 1=2 11=400 2=4
Permute                  permute_256              1 1 142 143 0=3
Slice                    split_3                  1 3 143 144 145 146 -23300=3,32,32,32 1=2
Split                    splitncnn_9              1 2 146 147 148
Permute                  transpose_349            1 1 144 149 0=1
MatMul                   matmul_331               2 1 149 145 150
BinaryOp                 mul_16                   1 1 150 151 0=2 1=1 2=0.176776692
Softmax                  softmax_4                1 1 151 152 0=3 1=1
MatMul                   matmultransb_1           2 1 148 152 153 0=1
Permute                  permute_257              1 1 153 154 0=4
Permute                  permute_258              1 1 147 155 0=4
Reshape                  reshape_297              1 1 154 156 0=64 1=40 2=40
Permute                  permute_259              1 1 156 157 0=4
Reshape                  reshape_298              1 1 155 158 0=64 1=40 2=40
Permute                  permute_260              1 1 158 159 0=4
ConvolutionDepthWise     convdw_377               1 1 159 160 0=64 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=1 6=3136 7=64
BinaryOp                 add_17                   2 1 157 160 161 0=0
Convolution              conv_50                  1 1 161 162 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
BinaryOp                 add_18                   2 1 137 162 163 0=0
Split                    splitncnn_10             1 2 163 164 165
Convolution              conv_51                  1 1 165 166 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_172                 1 1 166 167
Convolution              conv_52                  1 1 167 168 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
BinaryOp                 add_19                   2 1 164 168 169 0=0
Split                    splitncnn_11             1 3 169 170 171 172
Convolution              conv_53                  1 1 172 173 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288
Reshape                  flatten_398              1 1 173 174 0=1600 1=192
Permute                  transpose_351            1 1 174 175 0=1
Reshape                  reshape_299              1 1 175 176 0=96 1=2 11=400 2=4
Permute                  permute_261              1 1 176 177 0=3
Slice                    split_4                  1 3 177 178 179 180 -23300=3,32,32,32 1=2
Split                    splitncnn_12             1 2 180 181 182
Permute                  transpose_352            1 1 178 183 0=1
MatMul                   matmul_333               2 1 183 179 184
BinaryOp                 mul_20                   1 1 184 185 0=2 1=1 2=0.176776692
Softmax                  softmax_5                1 1 185 186 0=3 1=1
MatMul                   matmultransb_2           2 1 182 186 187 0=1
Permute                  permute_262              1 1 187 188 0=4
Permute                  permute_263              1 1 181 189 0=4
Reshape                  reshape_300              1 1 188 190 0=64 1=40 2=40
Permute                  permute_264              1 1 190 191 0=4
Reshape                  reshape_301              1 1 189 192 0=64 1=40 2=40
Permute                  permute_265              1 1 192 193 0=4
ConvolutionDepthWise     convdw_378               1 1 193 194 0=64 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=1 6=3136 7=64
BinaryOp                 add_21                   2 1 191 194 195 0=0
Convolution              conv_54                  1 1 195 196 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
BinaryOp                 add_22                   2 1 171 196 197 0=0
Split                    splitncnn_13             1 2 197 198 199
Convolution              conv_55                  1 1 199 200 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_173                 1 1 200 201
Convolution              conv_56                  1 1 201 202 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
BinaryOp                 add_23                   2 1 198 202 203 0=0
Split                    splitncnn_14             1 2 203 204 205
Convolution              conv_57                  1 1 205 206 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288
Reshape                  flatten_399              1 1 206 207 0=1600 1=192
Permute                  transpose_354            1 1 207 208 0=1
Reshape                  reshape_302              1 1 208 209 0=96 1=2 11=400 2=4
Permute                  permute_266              1 1 209 210 0=3
Slice                    split_5                  1 3 210 211 212 213 -23300=3,32,32,32 1=2
Split                    splitncnn_15             1 2 213 214 215
Permute                  transpose_355            1 1 211 216 0=1
MatMul                   matmul_335               2 1 216 212 217
BinaryOp                 mul_24                   1 1 217 218 0=2 1=1 2=0.176776692
Softmax                  softmax_6                1 1 218 219 0=3 1=1
MatMul                   matmultransb_3           2 1 215 219 220 0=1
Permute                  permute_267              1 1 220 221 0=4
Permute                  permute_268              1 1 214 222 0=4
Reshape                  reshape_303              1 1 221 223 0=64 1=40 2=40
Permute                  permute_269              1 1 223 224 0=4
Reshape                  reshape_304              1 1 222 225 0=64 1=40 2=40
Permute                  permute_270              1 1 225 226 0=4
ConvolutionDepthWise     convdw_379               1 1 226 227 0=64 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=1 6=3136 7=64
BinaryOp                 add_25                   2 1 224 227 228 0=0
Convolution              conv_58                  1 1 228 229 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
BinaryOp                 add_26                   2 1 204 229 230 0=0
Split                    splitncnn_16             1 2 230 231 232
Convolution              conv_59                  1 1 232 233 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_174                 1 1 233 234
Convolution              conv_60                  1 1 234 235 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
BinaryOp                 add_27                   2 1 231 235 236 0=0
Concat                   cat_2                    3 1 103 170 236 237 0=0
Convolution              conv_61                  1 1 237 238 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_175                 1 1 238 239
Split                    splitncnn_17             1 4 239 240 241 242 243
Pooling                  gap_16                   1 1 240 244 0=1 4=1
Convolution              conv_62                  1 1 244 245 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_176                 1 1 245 246
Convolution              conv_63                  1 1 246 247 0=3 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=48
Softmax                  softmax_7                1 1 247 248 0=0 1=1
Reshape                  reshape_305              1 1 248 249 0=1 1=1 2=-1
Tile                     repeat_327               1 1 249 250 -23302=3,1,40,40
ConvolutionDepthWise     convdw_380               1 1 243 251 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=1152 7=128
Convolution              conv_64                  1 1 251 252 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_177                 1 1 252 253
Slice                    tensor_split_2           1 3 250 254 255 256 -23300=3,1,1,-233 1=0
ConvolutionDepthWise     convdw_381               1 1 242 257 0=128 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=0 6=3200 7=128
Convolution              conv_65                  1 1 257 258 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_178                 1 1 258 259
ConvolutionDepthWise     convdw_382               1 1 241 260 0=128 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=0 6=6272 7=128
Convolution              conv_66                  1 1 260 261 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_179                 1 1 261 262
BinaryOp                 mul_28                   2 1 262 256 263 0=2
BinaryOp                 mul_29                   2 1 259 255 264 0=2
BinaryOp                 mul_30                   2 1 253 254 265 0=2
BinaryOp                 add_31                   2 1 265 264 266 0=0
BinaryOp                 add_32                   2 1 266 263 267 0=0
BatchNorm                bn_20                    1 1 267 268 0=128 1=0.001
Swish                    silu_180                 1 1 268 269
Split                    splitncnn_18             1 2 269 270 271
Convolution              conv_67                  1 1 271 272 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=294912
Swish                    silu_181                 1 1 272 273
Convolution              conv_68                  1 1 273 274 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_182                 1 1 274 275
Split                    splitncnn_19             1 3 275 276 277 278
Convolution              conv_69                  1 1 278 279 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=49152
Reshape                  flatten_400              1 1 279 280 0=400 1=384
Permute                  transpose_357            1 1 280 281 0=1
Reshape                  reshape_306              1 1 281 282 0=96 1=4 2=400
Permute                  permute_271              1 1 282 283 0=3
Slice                    split_6                  1 3 283 284 285 286 -23300=3,32,32,32 1=1
Split                    splitncnn_20             1 2 286 287 288
Permute                  transpose_358            1 1 284 289 0=1
MatMul                   matmul_337               2 1 289 285 290
BinaryOp                 mul_33                   1 1 290 291 0=2 1=1 2=0.176776692
Softmax                  softmax_8                1 1 291 292 0=2 1=1
MatMul                   matmultransb_4           2 1 288 292 293 0=1
Permute                  permute_272              1 1 293 294 0=4
Permute                  permute_273              1 1 287 295 0=4
Reshape                  reshape_307              1 1 294 296 0=128 1=20 2=20
Permute                  permute_274              1 1 296 297 0=4
Reshape                  reshape_308              1 1 295 298 0=128 1=20 2=20
Permute                  permute_275              1 1 298 299 0=4
ConvolutionDepthWise     convdw_383               1 1 299 300 0=128 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=1 6=6272 7=128
BinaryOp                 add_34                   2 1 297 300 301 0=0
Convolution              conv_70                  1 1 301 302 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
BinaryOp                 add_35                   2 1 277 302 303 0=0
Split                    splitncnn_21             1 2 303 304 305
Convolution              conv_71                  1 1 305 306 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_183                 1 1 306 307
Convolution              conv_72                  1 1 307 308 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
BinaryOp                 add_36                   2 1 304 308 309 0=0
Split                    splitncnn_22             1 2 309 310 311
Convolution              conv_73                  1 1 311 312 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=49152
Reshape                  flatten_401              1 1 312 313 0=400 1=384
Permute                  transpose_360            1 1 313 314 0=1
Reshape                  reshape_309              1 1 314 315 0=96 1=4 2=400
Permute                  permute_276              1 1 315 316 0=3
Slice                    split_7                  1 3 316 317 318 319 -23300=3,32,32,32 1=1
Split                    splitncnn_23             1 2 319 320 321
Permute                  transpose_361            1 1 317 322 0=1
MatMul                   matmul_339               2 1 322 318 323
BinaryOp                 mul_37                   1 1 323 324 0=2 1=1 2=0.176776692
Softmax                  softmax_9                1 1 324 325 0=2 1=1
MatMul                   matmultransb_5           2 1 321 325 326 0=1
Permute                  permute_277              1 1 326 327 0=4
Permute                  permute_278              1 1 320 328 0=4
Reshape                  reshape_310              1 1 327 329 0=128 1=20 2=20
Permute                  permute_279              1 1 329 330 0=4
Reshape                  reshape_311              1 1 328 331 0=128 1=20 2=20
Permute                  permute_280              1 1 331 332 0=4
ConvolutionDepthWise     convdw_384               1 1 332 333 0=128 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=1 6=6272 7=128
BinaryOp                 add_38                   2 1 330 333 334 0=0
Convolution              conv_74                  1 1 334 335 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
BinaryOp                 add_39                   2 1 310 335 336 0=0
Split                    splitncnn_24             1 2 336 337 338
Convolution              conv_75                  1 1 338 339 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_184                 1 1 339 340
Convolution              conv_76                  1 1 340 341 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
BinaryOp                 add_40                   2 1 337 341 342 0=0
Split                    splitncnn_25             1 3 342 343 344 345
Convolution              conv_77                  1 1 345 346 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=49152
Reshape                  flatten_402              1 1 346 347 0=400 1=384
Permute                  transpose_363            1 1 347 348 0=1
Reshape                  reshape_312              1 1 348 349 0=96 1=4 2=400
Permute                  permute_281              1 1 349 350 0=3
Slice                    split_8                  1 3 350 351 352 353 -23300=3,32,32,32 1=1
Split                    splitncnn_26             1 2 353 354 355
Permute                  transpose_364            1 1 351 356 0=1
MatMul                   matmul_341               2 1 356 352 357
BinaryOp                 mul_41                   1 1 357 358 0=2 1=1 2=0.176776692
Softmax                  softmax_10               1 1 358 359 0=2 1=1
MatMul                   matmultransb_6           2 1 355 359 360 0=1
Permute                  permute_282              1 1 360 361 0=4
Permute                  permute_283              1 1 354 362 0=4
Reshape                  reshape_313              1 1 361 363 0=128 1=20 2=20
Permute                  permute_284              1 1 363 364 0=4
Reshape                  reshape_314              1 1 362 365 0=128 1=20 2=20
Permute                  permute_285              1 1 365 366 0=4
ConvolutionDepthWise     convdw_385               1 1 366 367 0=128 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=1 6=6272 7=128
BinaryOp                 add_42                   2 1 364 367 368 0=0
Convolution              conv_78                  1 1 368 369 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
BinaryOp                 add_43                   2 1 344 369 370 0=0
Split                    splitncnn_27             1 2 370 371 372
Convolution              conv_79                  1 1 372 373 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_185                 1 1 373 374
Convolution              conv_80                  1 1 374 375 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
BinaryOp                 add_44                   2 1 371 375 376 0=0
Split                    splitncnn_28             1 2 376 377 378
Convolution              conv_81                  1 1 378 379 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=49152
Reshape                  flatten_403              1 1 379 380 0=400 1=384
Permute                  transpose_366            1 1 380 381 0=1
Reshape                  reshape_315              1 1 381 382 0=96 1=4 2=400
Permute                  permute_286              1 1 382 383 0=3
Slice                    split_9                  1 3 383 384 385 386 -23300=3,32,32,32 1=1
Split                    splitncnn_29             1 2 386 387 388
Permute                  transpose_367            1 1 384 389 0=1
MatMul                   matmul_343               2 1 389 385 390
BinaryOp                 mul_45                   1 1 390 391 0=2 1=1 2=0.176776692
Softmax                  softmax_11               1 1 391 392 0=2 1=1
MatMul                   matmultransb_7           2 1 388 392 393 0=1
Permute                  permute_287              1 1 393 394 0=4
Permute                  permute_288              1 1 387 395 0=4
Reshape                  reshape_316              1 1 394 396 0=128 1=20 2=20
Permute                  permute_289              1 1 396 397 0=4
Reshape                  reshape_317              1 1 395 398 0=128 1=20 2=20
Permute                  permute_290              1 1 398 399 0=4
ConvolutionDepthWise     convdw_386               1 1 399 400 0=128 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=1 6=6272 7=128
BinaryOp                 add_46                   2 1 397 400 401 0=0
Convolution              conv_82                  1 1 401 402 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
BinaryOp                 add_47                   2 1 377 402 403 0=0
Split                    splitncnn_30             1 2 403 404 405
Convolution              conv_83                  1 1 405 406 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_186                 1 1 406 407
Convolution              conv_84                  1 1 407 408 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
BinaryOp                 add_48                   2 1 404 408 409 0=0
Concat                   cat_3                    3 1 276 343 409 410 0=0
Convolution              conv_85                  1 1 410 411 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_187                 1 1 411 412
Split                    splitncnn_31             1 4 412 413 414 415 416
Pooling                  gap_17                   1 1 413 417 0=1 4=1
Convolution              conv_86                  1 1 417 418 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_188                 1 1 418 419
Convolution              conv_87                  1 1 419 420 0=3 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=96
Softmax                  softmax_12               1 1 420 421 0=0 1=1
Reshape                  reshape_318              1 1 421 422 0=1 1=1 2=-1
Tile                     repeat_328               1 1 422 423 -23302=3,1,20,20
ConvolutionDepthWise     convdw_387               1 1 416 424 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=2304 7=256
Convolution              conv_88                  1 1 424 425 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_189                 1 1 425 426
Slice                    tensor_split_3           1 3 423 427 428 429 -23300=3,1,1,-233 1=0
ConvolutionDepthWise     convdw_388               1 1 415 430 0=256 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=0 6=6400 7=256
Convolution              conv_89                  1 1 430 431 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_190                 1 1 431 432
ConvolutionDepthWise     convdw_389               1 1 414 433 0=256 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=0 6=12544 7=256
Convolution              conv_90                  1 1 433 434 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_191                 1 1 434 435
BinaryOp                 mul_49                   2 1 435 429 436 0=2
BinaryOp                 mul_50                   2 1 432 428 437 0=2
BinaryOp                 mul_51                   2 1 426 427 438 0=2
BinaryOp                 add_52                   2 1 438 437 439 0=0
BinaryOp                 add_53                   2 1 439 436 440 0=0
BatchNorm                bn_21                    1 1 440 441 0=256 1=0.001
Swish                    silu_192                 1 1 441 442
Split                    splitncnn_32             1 2 442 443 444
Interp                   upsample_249             1 1 444 445 0=1 1=2.0 2=2.0 6=0
Concat                   cat_4                    2 1 445 270 446 0=0
Convolution              conv_91                  1 1 446 447 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=49152
Swish                    silu_193                 1 1 447 448
Slice                    split_10                 1 2 448 449 450 -23300=2,64,64 1=0
Split                    splitncnn_33             1 3 450 451 452 453
Convolution              conv_92                  1 1 453 454 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_194                 1 1 454 455
Split                    splitncnn_34             1 2 455 456 457
Convolution              conv_93                  1 1 457 458 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_195                 1 1 458 459
Convolution              conv_94                  1 1 459 460 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_196                 1 1 460 461
BinaryOp                 add_54                   2 1 456 461 462 0=0
Split                    splitncnn_35             1 2 462 463 464
Convolution              conv_95                  1 1 464 465 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_197                 1 1 465 466
Convolution              conv_96                  1 1 466 467 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_198                 1 1 467 468
BinaryOp                 add_55                   2 1 463 468 469 0=0
Convolution              conv_97                  1 1 452 470 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_199                 1 1 470 471
Concat                   cat_5                    2 1 469 471 472 0=0
Convolution              conv_98                  1 1 472 473 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_200                 1 1 473 474
Concat                   cat_6                    3 1 449 451 474 475 0=0
Convolution              conv_99                  1 1 475 476 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_201                 1 1 476 477
Split                    splitncnn_36             1 2 477 478 479
Interp                   upsample_250             1 1 479 480 0=1 1=2.0 2=2.0 6=0
Concat                   cat_7                    2 1 480 97 481 0=0
Convolution              conv_100                 1 1 481 482 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_202                 1 1 482 483
Slice                    split_11                 1 2 483 484 485 -23300=2,32,32 1=0
Split                    splitncnn_37             1 3 485 486 487 488
Convolution              conv_101                 1 1 488 489 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
Swish                    silu_203                 1 1 489 490
Split                    splitncnn_38             1 2 490 491 492
Convolution              conv_102                 1 1 492 493 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_204                 1 1 493 494
Convolution              conv_103                 1 1 494 495 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_205                 1 1 495 496
BinaryOp                 add_56                   2 1 491 496 497 0=0
Split                    splitncnn_39             1 2 497 498 499
Convolution              conv_104                 1 1 499 500 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_206                 1 1 500 501
Convolution              conv_105                 1 1 501 502 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_207                 1 1 502 503
BinaryOp                 add_57                   2 1 498 503 504 0=0
Convolution              conv_106                 1 1 487 505 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
Swish                    silu_208                 1 1 505 506
Concat                   cat_8                    2 1 504 506 507 0=0
Convolution              conv_107                 1 1 507 508 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_209                 1 1 508 509
Concat                   cat_9                    3 1 484 486 509 510 0=0
Convolution              conv_108                 1 1 510 511 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144
Swish                    silu_210                 1 1 511 512
Split                    splitncnn_40             1 3 512 513 514 515
Convolution              conv_109                 1 1 514 516 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=36864
Swish                    silu_211                 1 1 516 517
Concat                   cat_10                   2 1 517 478 518 0=0
Convolution              conv_110                 1 1 518 519 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_212                 1 1 519 520
Slice                    split_12                 1 2 520 521 522 -23300=2,64,64 1=0
Split                    splitncnn_41             1 3 522 523 524 525
Convolution              conv_111                 1 1 525 526 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_213                 1 1 526 527
Split                    splitncnn_42             1 2 527 528 529
Convolution              conv_112                 1 1 529 530 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_214                 1 1 530 531
Convolution              conv_113                 1 1 531 532 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_215                 1 1 532 533
BinaryOp                 add_58                   2 1 528 533 534 0=0
Split                    splitncnn_43             1 2 534 535 536
Convolution              conv_114                 1 1 536 537 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_216                 1 1 537 538
Convolution              conv_115                 1 1 538 539 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_217                 1 1 539 540
BinaryOp                 add_59                   2 1 535 540 541 0=0
Convolution              conv_116                 1 1 524 542 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_218                 1 1 542 543
Concat                   cat_11                   2 1 541 543 544 0=0
Convolution              conv_117                 1 1 544 545 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_219                 1 1 545 546
Concat                   cat_12                   3 1 521 523 546 547 0=0
Convolution              conv_118                 1 1 547 548 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_220                 1 1 548 549
Split                    splitncnn_44             1 3 549 550 551 552
Convolution              conv_119                 1 1 551 553 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456
Swish                    silu_221                 1 1 553 554
Concat                   cat_13                   2 1 554 443 555 0=0
Convolution              conv_120                 1 1 555 556 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=49152
Swish                    silu_222                 1 1 556 557
Slice                    split_13                 1 2 557 558 559 -23300=2,64,64 1=0
Split                    splitncnn_45             1 3 559 560 561 562
Convolution              conv_121                 1 1 562 563 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_223                 1 1 563 564
Split                    splitncnn_46             1 2 564 565 566
Convolution              conv_122                 1 1 566 567 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_224                 1 1 567 568
Convolution              conv_123                 1 1 568 569 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_225                 1 1 569 570
BinaryOp                 add_60                   2 1 565 570 571 0=0
Split                    splitncnn_47             1 2 571 572 573
Convolution              conv_124                 1 1 573 574 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_226                 1 1 574 575
Convolution              conv_125                 1 1 575 576 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_227                 1 1 576 577
BinaryOp                 add_61                   2 1 572 577 578 0=0
Convolution              conv_126                 1 1 561 579 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_228                 1 1 579 580
Concat                   cat_14                   2 1 578 580 581 0=0
Convolution              conv_127                 1 1 581 582 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_229                 1 1 582 583
Concat                   cat_15                   3 1 558 560 583 584 0=0
Convolution              conv_128                 1 1 584 585 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_230                 1 1 585 586
Split                    splitncnn_48             1 2 586 587 588
MemoryData               pnnx_1592                0 1 589 0=8400
Convolution              conv_129                 1 1 513 590 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_231                 1 1 590 591
Convolution              conv_130                 1 1 591 592 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_232                 1 1 592 593
Convolution              conv_131                 1 1 593 594 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdw_390               1 1 515 595 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
Swish                    silu_233                 1 1 595 596
Convolution              conv_132                 1 1 596 597 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_234                 1 1 597 598
ConvolutionDepthWise     convdw_391               1 1 598 599 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
Swish                    silu_235                 1 1 599 600
Convolution              conv_133                 1 1 600 601 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_236                 1 1 601 602
Convolution              conv_134                 1 1 602 603 0=10 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=640
Concat                   cat_16                   2 1 594 603 604 0=0
Convolution              conv_135                 1 1 550 605 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
Swish                    silu_237                 1 1 605 606
Convolution              conv_136                 1 1 606 607 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_238                 1 1 607 608
Convolution              conv_137                 1 1 608 609 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdw_392               1 1 552 610 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
Swish                    silu_239                 1 1 610 611
Convolution              conv_138                 1 1 611 612 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_240                 1 1 612 613
ConvolutionDepthWise     convdw_393               1 1 613 614 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
Swish                    silu_241                 1 1 614 615
Convolution              conv_139                 1 1 615 616 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_242                 1 1 616 617
Convolution              conv_140                 1 1 617 618 0=10 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=640
Concat                   cat_17                   2 1 609 618 619 0=0
Convolution              conv_141                 1 1 587 620 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
Swish                    silu_243                 1 1 620 621
Convolution              conv_142                 1 1 621 622 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_244                 1 1 622 623
Convolution              conv_143                 1 1 623 624 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdw_394               1 1 588 625 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
Swish                    silu_245                 1 1 625 626
Convolution              conv_144                 1 1 626 627 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_246                 1 1 627 628
ConvolutionDepthWise     convdw_395               1 1 628 629 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
Swish                    silu_247                 1 1 629 630
Convolution              conv_145                 1 1 630 631 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_248                 1 1 631 632
Convolution              conv_146                 1 1 632 633 0=10 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=640
Concat                   cat_18                   2 1 624 633 634 0=0
Reshape                  reshape_319              1 1 604 635 0=6400 1=74
Reshape                  reshape_320              1 1 619 636 0=1600 1=74
Reshape                  reshape_321              1 1 634 637 0=400 1=74
Concat                   cat_19                   3 1 635 636 637 638 0=1
Slice                    split_14                 1 2 638 639 640 -23300=2,64,10 1=0
Reshape                  reshape_322              1 1 639 641 0=8400 1=16 2=4
Permute                  transpose_369            1 1 641 642 0=2
Softmax                  softmax_13               1 1 642 643 0=0 1=1
Convolution              conv_147                 1 1 643 644 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=16
Reshape                  reshape_323              1 1 644 645 0=8400 1=4
MemoryData               pnnx_fold_anchor_points.1 0 1 646 0=8400 1=2
Split                    splitncnn_0              1 2 646 647 648
Slice                    chunk_0                  1 2 645 649 650 -23300=2,-233,-233 1=0
BinaryOp                 sub_62                   2 1 647 649 651 0=1
Split                    splitncnn_49             1 2 651 652 653
BinaryOp                 add_63                   2 1 648 650 654 0=0
Split                    splitncnn_50             1 2 654 655 656
BinaryOp                 add_64                   2 1 652 655 657 0=0
BinaryOp                 div_65                   1 1 657 658 0=3 1=1 2=2.0
BinaryOp                 sub_66                   2 1 656 653 659 0=1
Concat                   cat_20                   2 1 658 659 660 0=0
Reshape                  reshape_324              1 1 589 661 0=8400 1=1
BinaryOp                 mul_67                   2 1 660 661 662 0=2
Sigmoid                  sigmoid_0                1 1 640 663
Concat                   cat_21                   2 1 662 663 out0 0=0
